In [1]:
# LAB -1 Statistical Analysis using Python: -

# EXERCISE - 2 - Data frame creation and manipulation 

import pandas as pd

In [2]:
# Create a data frame with details of 10 students and columns as Roll Number, Name, Gender, Marks1, Marks2, Marks3


data = {
        'Roll Number':[1,2,3,4,5,6,7,8,9,10],
        'Gender':['M','M','M','M','M','F','F','F','F','F'],
        'Name':['Surya','Joy','Shawn','Krish','Mark','Meera','Seetha','Jayanthi','Sujatha','Kausalya'],
        'Marks1':[79,60,75,92,83,98,57,78,78,56],
        'Marks2':[65,76,55,87,68,80,35,76,67,37],
        'Marks3':[53,37,39,84,77,93,62,66,84,68]
        }

students = pd.DataFrame(data)

students

   Roll Number Gender      Name  Marks1  Marks2  Marks3
0            1      M     Surya      79      65      53
1            2      M       Joy      60      76      37
2            3      M     Shawn      75      55      39
3            4      M     Krish      92      87      84
4            5      M      Mark      83      68      77
5            6      F     Meera      98      80      93
6            7      F    Seetha      57      35      62
7            8      F  Jayanthi      78      76      66
8            9      F   Sujatha      78      67      84
9           10      F  Kausalya      56      37      68

In [3]:
# Create a new column with total marks


total_marks = students['Marks1'] + students['Marks2'] + students['Marks3']
students['Total Marks'] = total_marks
students

   Roll Number Gender      Name  Marks1  Marks2  Marks3  Total Marks
0            1      M     Surya      79      65      53          197
1            2      M       Joy      60      76      37          173
2            3      M     Shawn      75      55      39          169
3            4      M     Krish      92      87      84          263
4            5      M      Mark      83      68      77          228
5            6      F     Meera      98      80      93          271
6            7      F    Seetha      57      35      62          154
7            8      F  Jayanthi      78      76      66          220
8            9      F   Sujatha      78      67      84          229
9           10      F  Kausalya      56      37      68          161

In [4]:
# Find the Lowest marks in Marks 1 

students['Marks1'].min()

56

In [5]:
# Find the Highest marks in Marks 2

students['Marks2'].max()

87

In [6]:
# Find the average marks in Marks 3

students['Marks3'].mean()

66.3

In [7]:
# 6. Find student name with Highest average


students[(students['Total Marks']/3) == (students['Total Marks']/3).max()]['Name']

                    # OR 
    
#     Avg_marks = students['Total Marks'] / 3     
#     students['Avg Marks'] = Avg_marks
#     students[students['Avg Marks'] == students['Avg Marks'].max()]['Name']
    
                    # OR 
    
#   students[(students['Total Marks']/3) == (students['Total Marks']/3).max()]

5    Meera
Name: Name, dtype: object

In [8]:
# Find how many students failed in Marks 2 ( <40 )


students[students['Marks2'] < 40].shape[0]         

                    # OR

#      len(students[students['Marks2'] < 40])


#      For number of columns in a DataFrame use: - df.shape[1]

2